{
    "Code": 0,
    "Data": [
        {
            "id": 61,
            "CAPEC_ID": 158,
            "Name": "Sniffing Network Traffic",
            "Abstraction": "Detailed",
            "Status": "Draft",
            "Description": "In this attack pattern, the adversary monitors network traffic between nodes of a public or multicast network in an attempt to capture sensitive information at the protocol level. Network sniffing applications can reveal TCP/IP, DNS, Ethernet, and other low-level network communication information. The adversary takes a passive role in this attack pattern and simply observes and analyzes the traffic. The adversary may precipitate or indirectly influence the content of the observed transaction, but is never the intended recipient of the target information.",
            "Alternate_Terms": null,
            "Likelihood_Of_Attack": null,
            "Typical_Severity": "Medium",
            "Related_Attack_Patterns": "::NATURE:ChildOf:CAPEC ID:157::",
            "Execution_Flow": null,
            "Prerequisites": "::The target must be communicating on a network protocol visible by a network sniffing application.::The adversary must obtain a logical position on the network from intercepting target network traffic is possible. Depending on the network topology, traffic sniffing may be simple or challenging. If both the target sender and target recipient are members of a single subnet, the adversary must also be on that subnet in order to see their traffic communication.::",
            "Skills_Required": "::SKILL:Adversaries can obtain and set up open-source network sniffing tools easily.:LEVEL:Low::",
            "Resources_Required": "::A tool with the capability of presenting network communication traffic (e.g., Wireshark, tcpdump, Cain and Abel, etc.).::",
            "Indicators": null,
            "Consequences": "::SCOPE:ConfidentialityTECHNICAL IMPACT:Read Data::",
            "Mitigations": "::Obfuscate network traffic through encryption to prevent its readability by network sniffers.::Employ appropriate levels of segmentation to your network in accordance with best practices.::",
            "Example_Instances": null,
            "Related_Weaknesses": "::311::",
            "Taxonomy_Mappings": "TAXONOMY NAME:ATTACK:ENTRY ID:1040:ENTRY NAME:Network Sniffing::",
            "Notes": null
        }
    ]
}